'use strict';
// Завдання 1:

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
// Якщо так – виведіть повідомлення 'Вірно' у alert().
// Якщо ні – виведіть 'Невірно'.
// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const num = Number(prompt('Введіть число'));
// if (num === 10) {
//   alert('Вірно!');
// } else {
//   alert('Не вірно!');
// }

// Завдання 2:

// У змінній min лежить випадкове число від 0 до 59.
// // Визначте, в яку чверть години потрапляє
// // це число (у першу, другу, третю чи четверту).
// // Виведіть в alert відповідне повідомлення, наприклад:
// // "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);
// console.log(min);
// let qUarter;

// let quarter;
// if (min >= 0 && min <= 15) {
//   qUarter = 'першу';
// } else if (min >= 16 && min <= 30) {
//   qUarter = 'другу';
// } else if (min >= 31 && min <= 45) {
//   qUarter = 'третю';
// } else if (min >= 46 && min <= 59) {
//   qUarter = 'четверту';
// }
// const msg = `${min} входить в ${qUarter} чверть`;
// alert(msg);

// Завдання 3:

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// // (запитуй це значення у користувача через prompt).
// // Якщо вона має значення '1', то у змінну result запишіть 'зима',
// // якщо має значення '2' - 'весна' і так далі.
// //Розв'яжіть завдання через switch-case.
// // Не забудьте про дефолтне значення, на випадок, якщо користувач
// // введе в prompt щось інше. В такому випадку result має набувати значення:
// // "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// // Значення змінної result виведіть в консоль.

// const num = prompt('Введіть число від 1 до 4');
// let result;
// switch (num) {
//   case '1':
//     result = 'зима';
//     break;
//   case '2':
//     result = 'весна';
//     break;
//   case '3':
//     result = 'літо';
//     break;
//   case '4':
//     result = 'осінь';
//     break;
//   default:
//     result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';
// }
// console.log(result);

// Завдання 4:

// Отримуйте від користувача число (кількість хвилин) через prompt
// // і виводьте у консоль рядок у форматі годин та хвилин.
// // Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// // Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// JavaScript version of: (unsigned)
// printf "%0*d" width num
function leftFillNum(num, targetLength) {
  return num.toString().padStart(targetLength, '0');
}
// const num = 123;
// console.log(leftFillNum(num, 5)); // "00123"

// const min = Number(prompt('Введіть кількість хвилин'));
// const minsInDay = min % 1440; //відсікли час поза добою
// const holeMin = minsInDay % 60; //визначили хвилини поточної години
// const hours =
//   (minsInDay - holeMin) / 60 === 24 ? 0 : (minsInDay - holeMin) / 60; //визначили час в годинниковому форматі
// console.log(`${leftFillNum(hours, 2)}:${leftFillNum(holeMin, 2)}`);

// Завдання 5:

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера
// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"
// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// const login = prompt('Введіть логін');
// console.log(login);
// if (login === 'Адмін') {
//   const passw = prompt('Введіть пароль');
//   if (passw === '' || passw === null) {
//     alert('Скасовано');
//   } else if (passw === 'Я головний') {
//     alert('Добрий день!');
//   } else {
//     alert('Невірний пароль!');
//     alert('Я вас не знаю');
//   }
// }

// Завдання 6:

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
// let i = 0;
// while (i <= 20) {
//   console.log(i);
//   i++;
// }

// Завдання 7:

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// // мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
//  і поверніть її з функції.

// function getNumbers(min, max) {
//   let sum = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(i);
//     if (!(i % 2)) {
//       sum += i;
//     }
//   }
//   return sum;
// }
// console.log('sum even numbers ', getNumbers(1, 10));

// Завдання 8:

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.
// function min(a, b) {
//   if (typeof a === 'number' && typeof b === 'number') {
//     return Math.min(...arguments);
//   }
//   return 'Not a number!';
// }

// console.log(min(0, 1, 2, 4, 5, 6, 7, 8, -5));

// Завдання 9:

// Напишіть функцію isAdult(age), яка приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).
// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   } else {
//     return confirm('Підтвердіть свый вік!!!');
//   }
// }
// console.log(isAdult(Number(prompt('Введіть свій вік'))));

// Завдання 10:

// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.
function fizzBuzz(num) {
  let rez = '';
  for (let i = 1; i <= num; i++) {
    rez = '';
    if (!(i % 3)) {
      rez = 'fizz';
    }
    if (!(i % 5)) {
      rez += 'buzz';
    }
    console.log(i, rez);
  }
  return true;
}

fizzBuzz(30);
